new-dftpunk-emacs.org
#+title Deftpunk Emacs
#+author: Erick Bodine <erick.bodine@gmail.com>
#+property: header-args :tangle "/Users/ebodine/MyStuff/dftpunk-emacs/init.el"
#+startup: content
#+auto_tangle: t

* About

My version of Emacs for MacOS - an attempt to be more minimalistic &
use builtin functionality.  All of which is, of course, relative.

** Installation

My notes for installing from scratch.

Dependencies:
- zsh + oh-my-zsh
- git
- trash
- delta
- ripgrep
- cmake   -> for compiling libvterm
- jinx, enchant
- building emacs-lsp-booster
  - clone the repo
  - update Rust toolchain -> rustup update
  - cargo build --release
  - cp target/release/emacs-lsp-booster to $PATH
- clone and build libvterm
- font-hack-nerd-font

GPG:
- brew install gpg2 pinentry-mac
- add =pinentry-program /opt/homebrew/bin/pinentry-mac= to ~//.gnupg/gpg-agent.conf
- =killall gpg-agent=

I am using emacs-plus: https://github.com/d12frosted/homebrew-emacs-plus

1. brew tap d12frosted/emacs-plus
2. brew install emacs-plus@<version>

Clone this dotfiles repository.

Run =emacs --quick --script ~/.emacs.d/scripts/get-env.el= to generate the environment variables file.

After package installations and dynamic lib compilations run `all-the-icons-install-fonts`

* Early-Init
:properties:
:header-args: :tangle "/Users/ebodine/MyStuff/dftpunk-emacs/early-init.el"
:end:
#+name: early-init-header-block
#+begin_src emacs-lisp :exports none
;;; early-init.el --- deftpunk early-init file. -*- lexical-binding: t; -*-
;;;
;;; Commentary:
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in emacs.d/dftpnk-emacs.org
;;;
;;; Code:
#+end_src
** Turn off package.el

#+begin_src emacs-lisp :name turn-off-package.el
  (setq package-enable-at-startup nil)
#+end_src

** Startup hook

#+begin_src emacs-lisp :name startup-hook
;; Time how long Emacs starts up.
;; Use a hook so the message doesn't get clobbered by other messages.
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
#+end_src

** Environment variables.

Using this methodology instead of [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]]

#+begin_src emacs-lisp :name load-env-file
  (defun load-env-file (file)
    "Read and set envvars from FILE."
    (if (null (file-exists-p file))
        (signal 'file-error
                (list "No envvar file exists." file
                      "Run `emacs --quick --script ~/.emacs.d/scripts/gen-env-file.el` from a terminal."))
      (with-temp-buffer
        (insert-file-contents file)
        (when-let (env (read (current-buffer)))
          (let ((tz (getenv-internal "TZ")))
            (setq-default process-environment (append env (default-value 'process-environment))
                          exec-path (append (split-string (getenv "PATH") path-separator t)
                                            (list exec-directory))
                          shell-file-name (or (getenv "SHELL") (default-value 'shell-file-name)))
            (when-let (newtz (getenv-internal "TZ"))
              (unless (equal tz newtz)
                (set-time-zone-rule newtz))))
          env))))

  (load-env-file "~/.emacs.d/var/env.el")
#+end_src

** Setting =LIBRARY_PATH= & =LSP_USE_PLISTS= explicitly

#+begin_src emacs-lisp :name library_path
  ;; Mostly prevents libgccjit errors; manually setting to the latest gcc path is brittle.
  ;; I had to update the path below to the latest gcc/libgccjit, uninstall/re-install emacs-plus, then run `emacs -nw` to get the native-comp to work properly.
  ;; Solution found at: https://github.com/d12frosted/homebrew-emacs-plus/issues/554
  (setenv "LIBRARY_PATH"
          (string-join
           '("/opt/homebrew/lib/gcc/current"
             "/opt/homebrew/opt/libgccjit/lib/gcc/current"
             "/opt/homebrew/opt/gcc/lib/gcc/current"
             "/opt/homebrew/opt/gcc/lib/gcc/15/gcc/aarch64-apple-darwin24/15")
           ":"))

  ;; Use plists for deserialization for lsp-mode
  (setenv "LSP_USE_PLISTS" "true")
#+end_src

** Remove some chrome

#+begin_src emacs-lisp :name remove-chrome
  ;; Get rid of some window chrome.
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1)

  ;; Remove the startup nonsense and replace w/ mine.
  (setq inhibit-startup-screen t
        inhibit-startup-message t
        inhibit-startup-echo-area-message t
        inhibit-splash-screen t
        initial-scratch-message ";;; Welcome to the Church of Emacs ;;;")

  (setq use-file-dialog nil)

#+end_src

** Some performance help.

#+begin_src emacs-lisp :name perf
  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we easily halve startup times with fonts that are
  ;; larger than the system default.
  (setq frame-inhibit-implied-resize t
        frame-resize-pixelwise t
        cursor-in-non-selected-windows nil)

  ;; Initial GC numbers
  ;; Set here, at the top of init.el and then reset at end of init.el
  (setq gc-cons-threshold most-positive-fixnum)
#+end_src

** Early key unset/set

#+begin_src emacs-lisp :name unset-set-keys
  ;; Unbind some Super keys on my Mac
  (global-unset-key (kbd "s-a"))
  (global-unset-key (kbd "s-d"))
  (global-unset-key (kbd "s-f"))
  (global-unset-key (kbd "s-g"))
  (global-unset-key (kbd "s-h"))
  (global-unset-key (kbd "s-i"))
  (global-unset-key (kbd "s-j"))
  (global-unset-key (kbd "s-k"))
  (global-unset-key (kbd "s-m"))
  (global-unset-key (kbd "s-o"))
  (global-unset-key (kbd "s-p"))
  (global-unset-key (kbd "s-s"))
  (global-unset-key (kbd "s-t"))
  (global-unset-key (kbd "s-u"))
  (global-unset-key (kbd "s-w"))
  (global-unset-key (kbd "s-y"))
#+end_src

#+name: early-init-footer-block
#+begin_src emacs-lisp :exports none
(provide 'early-init)
;;; early-init.el ends here
#+end_src

* Init
#+name: init-header-block
#+begin_src emacs-lisp :exports none
;;; init.el --- deftpunk Emacs config file -*- lexical-binding: t; -*-
;;;
;;; Commentary:
;;; Emacs `init.el' config for deftpunk
;;; This file was automatically generated by `org-babel-tangle'.
;;; Do not change this file.  Main config is located in emacs.d/deftpunk-emacs.org
;;;
;;; Code:
#+end_src

** Set some deftpunk variables

=etc/= - For files & directories that we save across systems, e.g. dictionaries, abbreviations
=var/= - For files & directories that are local, e.g. caches, backups

#+begin_src emacs-lisp :name globals

  (defconst deftpunk--emacs-dir (file-truename "~/.emacs.d")
    "The path to the emacs.d directory")

  (defconst deftpunk--org-configuration-file (concat deftpunk--emacs-dir "/deftpunk-emacs.org")
    "The Org mode literate configuration file.")

  (defconst deftpunk--etc-dir (concat deftpunk--emacs-dir "/etc/")
    "Location for files to save across systems.")

  (defconst deftpunk--var-dir (concat deftpunk--emacs-dir "/var/")
    "Location for cache & files that we don't save across systems.")

  ;; I use Mac & occasionally Linux, no Windoze.
  (defconst IS-MAC (eq system-type 'darwin))
  (defconst IS-LINUX (eq system-type 'gnu/linux))
#+end_src

** Package Management

Starting to use elpaca with =use-package= instead of straight for package management.

Type =M-x elpaca-manager= to search, get info, etc.

*** [[https://github.com/progfolio/elpaca][elpaca]]

Package management: async and manager (`elpaca-manager`)

The Basics: https://www.youtube.com/watch?v=5Ud-TE3iIQY
The Manual: https://github.com/progfolio/elpaca/blob/master/doc/manual.md

use-package manual: https://www.gnu.org/software/emacs/manual/html_node/use-package/index.html#SEC_Contents

#+begin_src emacs-lisp :name elpaca
(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))

  ;; Install a package via the elpaca macro
  ;; See the "recipes" section of the manual for more details.

  ;; (elpaca example-package)

  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable :elpaca use-package keyword.
    (elpaca-use-package-mode)
    ;; Assume :elpaca t unless otherwise specified.
    (setq elpaca-use-package-by-default t))

  ;; Block until current queue processed.
  (elpaca-wait)

  ;;When installing a package which modifies a form used at the top-level
  ;;(e.g. a package which adds a use-package key word),
  ;;use `elpaca-wait' to block until that package has been installed/configured.
  ;;For example:
  ;;(use-package general :demand t)
  ;;(elpaca-wait)

  ;; Expands to: (elpaca evil (use-package evil :demand t))
  ;; (use-package evil :demand t)

  ;;Turns off elpaca-use-package-mode current declaration
  ;;Note this will cause the declaration to be interpreted immediately (not deferred).
  ;;Useful for configuring built-in emacs features.
  ;; (use-package emacs :elpaca nil :config (setq ring-bell-function #'ignore))

  ;; Don't install anything. Defer execution of BODY
  ;; (elpaca nil (message "deferred"))
#+end_src

*** [[https://github.com/noctuid/general.el][General]]

Better manage some keybindings.

#+begin_src emacs-lisp :name general.el
  (use-package general)

  (elpaca-wait)

  ;; Leader key
  (general-create-definer deftpunk-leader-def
    :keymaps 'override
    :prefix-map 'deftpunk-leader-map
    :prefix "s-SPC")

  ;; local leader
  ;; This allows for finer granularity than hydra-major-mode by binding to individual key maps.
  (general-create-definer deftpunk-local-leader-def
    :keymaps 'override
    :prefix "C-;")

  (general-create-definer deftpunk-source-control
    :keymaps 'override
    :prefix "C-c g")
#+end_src

